cask_args appdir: '/Applications'

#tap
tap "homebrew/fuse"
tap "homebrew/python"
tap "caskroom/cask"
tap "neovim/neovim"
tap "homebrew/php"

#brew
brew "phantomjs"
brew "ntfs-3g"
brew "openssl"
brew "readline"
brew "wget"
brew "the_silver_searcher"
brew "neovim"
brew "tmux"
brew "git-lfs"

# for alfred workflow
brew "php56"      
brew "php56-intl"

#dev
brew "redis"
brew "rabbitmq"
brew "imagemagick"

#dev-python
brew "python3"
brew "numpy", args:['with-python3']
brew "autoenv"
brew "open-mpi"  #for mpi4py

cask "1password"
cask "slack"
cask "steam"
cask "vlc"
cask "google-chrome"
cask "launchcontrol"
cask "licecap"
cask "coconutbattery"
cask "insomnia"
cask "google-cloud-sdk"
cask "spectacle"
